k = int(input("Введите номер месяца: "))

# куча условий if/elif
if k == 1: print("январь")
elif k == 2: print("февраль")
elif k == 3: print("март")
elif k == 4: print("апрель")
elif k == 5: print("май")
elif k == 6: print("июнь")
elif k == 7: print("июль")
elif k == 8: print("август")
elif k == 9: print("сентябрь")
elif k == 10: print("октябрь")
elif k == 11: print("ноябрь")
elif k == 12: print("декабрь")
else : print("нет такого месяца")

# подход со словарем
months = {
    1:"январь",
    2:"февраль",
    3:"март",
    4:"апрель",
    5:"май",
    6:"июнь",
    7:"июль",
    8:"август",
    9:"сентябрь",
    10:"октябрь",
    11:"ноябрь",
    12:"декабрь",
    }

print("Этот месяц -",months[k])
